
********************************************* original model *********************************************

Model: "cmvae_direct"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dronet (Dronet)              multiple                  346260
_________________________________________________________________
img_decoder (ImgDecoder)     multiple                  2526707
_________________________________________________________________
non_linear_transformer (NonL multiple                  2241
_________________________________________________________________
non_linear_transformer_1 (No multiple                  2241
_________________________________________________________________
non_linear_transformer_2 (No multiple                  2241
_________________________________________________________________
non_linear_transformer_3 (No multiple                  2241
_________________________________________________________________
lambda (Lambda)              multiple                  0
_________________________________________________________________
lambda_1 (Lambda)            multiple                  0
_________________________________________________________________
lambda_2 (Lambda)            multiple                  0
_________________________________________________________________
lambda_3 (Lambda)            multiple                  0
_________________________________________________________________
lambda_4 (Lambda)            multiple                  0
_________________________________________________________________
lambda_5 (Lambda)            multiple                  0
=================================================================
Total params: 2,881,931
Trainable params: 2,881,227
Non-trainable params: 704



********************************************* updated model *********************************************

Model: "cmvae_direct"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dronet (Dronet)              multiple                  1249684
_________________________________________________________________
img_decoder (ImgDecoder)     multiple                  2526707
_________________________________________________________________
non_linear_transformer (NonL multiple                  2241
_________________________________________________________________
non_linear_transformer_1 (No multiple                  2241
_________________________________________________________________
non_linear_transformer_2 (No multiple                  2241
_________________________________________________________________
non_linear_transformer_3 (No multiple                  2241
_________________________________________________________________
lambda (Lambda)              multiple                  0
_________________________________________________________________
lambda_1 (Lambda)            multiple                  0
_________________________________________________________________
lambda_2 (Lambda)            multiple                  0
_________________________________________________________________
lambda_3 (Lambda)            multiple                  0
_________________________________________________________________
lambda_4 (Lambda)            multiple                  0
_________________________________________________________________
lambda_5 (Lambda)            multiple                  0
=================================================================
Total params: 3,785,355
Trainable params: 3,783,883
Non-trainable params: 1,472