Model: "bc_dense"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_15 (Dense)             multiple                  2816
_________________________________________________________________
dropout (Dropout)            multiple                  0
_________________________________________________________________
dense_16 (Dense)             multiple                  16448
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0
_________________________________________________________________
dense_17 (Dense)             multiple                  1040
_________________________________________________________________
dropout_2 (Dropout)          multiple                  0
_________________________________________________________________
dense_18 (Dense)             multiple                  68
_________________________________________________________________
dropout_3 (Dropout)          multiple                  0
=================================================================
Total params: 20,372
Trainable params: 20,372
Non-trainable params: 0
_________________________________________________________________