_________________________________________________________________
Model: "dronet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d (MaxPooling2D) multiple                  0         
_________________________________________________________________
batch_normalization (BatchNo multiple                  128       
_________________________________________________________________
batch_normalization_1 (Batch multiple                  128       
_________________________________________________________________
batch_normalization_2 (Batch multiple                  128       
_________________________________________________________________
batch_normalization_3 (Batch multiple                  256       
_________________________________________________________________
batch_normalization_4 (Batch multiple                  256       
_________________________________________________________________
batch_normalization_5 (Batch multiple                  512       
_________________________________________________________________
conv2d (Conv2D)              multiple                  2432      
_________________________________________________________________
conv2d_1 (Conv2D)            multiple                  9248      
_________________________________________________________________
conv2d_2 (Conv2D)            multiple                  9248      
_________________________________________________________________
conv2d_3 (Conv2D)            multiple                  1056      
_________________________________________________________________
conv2d_4 (Conv2D)            multiple                  18496     
_________________________________________________________________
conv2d_5 (Conv2D)            multiple                  36928     
_________________________________________________________________
conv2d_6 (Conv2D)            multiple                  2112      
_________________________________________________________________
conv2d_7 (Conv2D)            multiple                  73856     
_________________________________________________________________
conv2d_8 (Conv2D)            multiple                  147584    
_________________________________________________________________
conv2d_9 (Conv2D)            multiple                  8320      
_________________________________________________________________
dense (Dense)                multiple                  32832     
_________________________________________________________________
dense_1 (Dense)              multiple                  2080      
_________________________________________________________________
dense_2 (Dense)              multiple                  660       
=================================================================
Total params: 346,260
Trainable params: 345,556
Non-trainable params: 704
_________________________________________________________________